a = '''
앞선 성장과정을 바탕으로 더 전문적인 더 전문적인 데이터사이언티스트로 거듭나고 싶습니다. 이를 위해 대학원 진학을 희망하고 저는 대학원 입학 이후 크게 3가지 목표를 잡았습니다. 

1. 하루도 빠짐없이 매일 알고리즘 문제를 해결하겠습니다. 

대학교 수업에서 부터 알고리즘에 관심이 많았고 A+를 받을 정도로 열심히 했습니다만 꾸준히 할 생각을 못했습니다. 하지만 학부연구생을 진행하면서 데이터사이언티스트에게 기본이 되는 역량은 주어진 데이터를 내가 원하는 문제의 해결점으로 변환하기 위해 여러 알고리즘을 적용하여 작업이라고 느꼈습니다. 

이에 2/25 부터 현재까지 계속해서 꾸준히 알고리즘을 익히기 위해 노력해왔고 지금 까지 83문제를 풀었고 총 493점의 레이팅을 높였습니다. 이러한 노력은 시간이 지나면서 더 가치가 있을 것이라 믿고 꾸준히 도전할 것입니다.

1. Knowledge-intensive한 상황에도 강건한 거대 언어 모델을 만들겠습니다.

ChatGPT가 등장한 이후 많은 문제가 해결되었다고 하지만 실제 사회 문제를 해결하기 위해서는 hallucination, helpfullness, Model size 등 여전히 남아 있는 문제가 있습니다. 이러한 문제점들은 어떻게 해결하고 있는지 알기 위해 언어 모델들을 공부했고 좋은 기회로 스터디에서 REPLUG:Retrieval-Augmented Black-Box Language Models를 리뷰한 경험이 있습니다. 간단히 요약하면 현재 API로만 접근 가능한 거대 언어 모델로 인해 Knowledge-intensive한 task를 풀기 위해 언어 모델은 학습할 수 없는 제약조건에 대한 해결 방법을 제안한 논문입니다. 이는 지식이 많이 요구되는 전문 분야 혹은 답변에 명확한 근거가 필요한 환경에서 많이 사용될 것이라 기대가 되었습니다.

대학원에 입학하여 마주하게 되는 사회문제를 더 구체적으로 보고 거대 언어 모델이 general한 답변만 하는 것이 아닌 numerical reasoning 혹은 전문 분야에도 능통하게 활용 가능하도록 연구해 보고 싶습니다.

1. input에 유연한 데이터사이언티스트가 되겠습니다. 

빅데이터 시대가 도래하면서 사진, 영상, 음성, 텍스트 등 많은 비정형 데이터를 다루는 것이 중요해졌습니다. 또한 여러 비정형 데이터의 조합으로 발생하는 모델도 등장하고 있습니다. 앞으로도 더 다양한 방법으로 연구가 진행되고 발전 될 것이라 생각하기 때문에 여러 입력을 다양하게 받을 수 있어야 한다고 생각했습니다. 이에 현재 Pseudo Lab에 8기로 Multimodal이 가진 **Infinite Dimensions** 살펴보기 스터디를 진행하고 있습니다. 다양한 논문을 리뷰 해보면서 자연어 처리 만이 아닌 AI 전반에 대해서도 이해하고 응용할 수 있는 유연한 데이터사이언티스트가 되겠습니다.
'''
print(len(a))